In [1]:
from __future__ import print_function, division
import geopandas as gp
import pandas as pd
import numpy as np
import pylab as pl
import matplotlib.pyplot as plt
import os
import json
import seaborn
import statsmodels.api as sm
from pandas.tools.plotting import scatter_matrix

%pylab inline

Populating the interactive namespace from numpy and matplotlib

In [2]:
incomedata = pd.read_csv('median income by town in MA.csv')
incomedata.head()

,Id,Id2,Geography,Target Geo Id,Target Geo Id2,Geographic Area,Dollar,Margin of Error,Geographic Area.1
0,0100000US,NaN,United States,1600000US2500135,2500135,United States - Massachusetts - Abington CDP,87139,6492,Abington
1,0100000US,NaN,United States,1600000US2500530,2500530,United States - Massachusetts - Acushnet Cente...,71667,12877,Acushnet
2,0100000US,NaN,United States,1600000US2500590,2500590,United States - Massachusetts - Adams CDP,55093,15995,Adams
3,0100000US,NaN,United States,1600000US2500840,2500840,United States - Massachusetts - Agawam Town city,77969,4094,Agawam
4,0100000US,NaN,United States,1600000US2501260,2501260,United States - Massachusetts - Amesbury Town ...,95963,8325,Amesbury

In [3]:
incomedata.drop(['Id', 'Id2', 'Geography', 'Target Geo Id', 'Target Geo Id2', 'Geographic Area'], axis=1, inplace=True)
incomedata.head()

  Dollar Margin of Error Geographic Area.1
0  87139            6492         Abington
1  71667           12877        Acushnet
2  55093           15995            Adams
3  77969            4094          Agawam
4  95963            8325        Amesbury

In [4]:
incomedata['Geographic Area.1'].values[0]

'Abington '

In [5]:
#FBB notice the space after the end of the string

In [6]:
incomedata.rename(columns={'Geographic Area.1': 'Town'}, inplace=True)

In [7]:
educationdata = pd.read_csv('Graduates_Attending_College_by_Town_2012.csv')

In [8]:
educationdata.head()

,Graduating Year,District Code,District Name,In/Out-of-State,Student Group,# High School Graduates,# Attending Coll./Univ.,% Attending Coll./Univ.,% Private Two-Year,% Private Four-Year,% Public Two-Year,% Public Four-Year,% MA Community College,% MA State University,% Univ. of Mass.
0,2012,10000,Abington,All Colleges,All Students,115,90,78.30%,0%,26.70%,37.80%,35.60%,36.70%,18.90%,11.10%
1,2012,30000,Acushnet,All Colleges,All Students,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2012,50000,Agawam,All Colleges,All Students,301,246,81.70%,0%,30.50%,40.70%,28.90%,39%,13.80%,9.30%
3,2012,70000,Amesbury,All Colleges,All Students,135,109,80.70%,0%,23.90%,37.60%,38.50%,34.90%,7.30%,15.60%
4,2012,90000,Andover,All Colleges,All Students,430,390,90.70%,0%,53.80%,11.30%,34.90%,10.80%,4.90%,14.40%

In [9]:
educationdata['District Name'].values[0]

'Abington'

In [10]:
#FBB notice the **lack** of space after the end of the name. 

#use the strip() method of strings and the apply function to remove the spaces at the end of the names of each district

In [17]:
educationdata.columns

Index([u'Graduating Year', u'District Code', u'District Name',
       u'In/Out-of-State', u'Student Group', u'# High School Graduates',
       u'# Attending Coll./Univ.', u'% Attending Coll./Univ.',
       u'% Private Two-Year', u'% Private Four-Year', u'% Public Two-Year',
       u'% Public Four-Year', u'% MA Community College',
       u'% MA State University', u'% Univ. of Mass.'],
      dtype='object')

In [18]:
educationdata.drop([u'Graduating Year', u'District Code',
       u'In/Out-of-State', u'Student Group',
       u'% Private Two-Year', u'% Public Two-Year', u'% MA Community College',
       u'% MA State University', u'% Univ. of Mass.'], axis=1, inplace=True)
educationdata.head()

,District Name,# High School Graduates,# Attending Coll./Univ.,% Attending Coll./Univ.,% Private Four-Year,% Public Four-Year
0,Abington,115,90.0,78.30%,26.70%,35.60%
1,Acushnet,1,NaN,NaN,NaN,NaN
2,Agawam,301,246.0,81.70%,30.50%,28.90%
3,Amesbury,135,109.0,80.70%,23.90%,38.50%
4,Andover,430,390.0,90.70%,53.80%,34.90%

In [22]:
educationdata.rename(columns={'District Name': 'Town'}, inplace=True)
educationdata.head()

,Town,# High School Graduates,# Attending Coll./Univ.,% Attending Coll./Univ.,% Private Four-Year,% Public Four-Year
0,Abington,115,90.0,78.30%,26.70%,35.60%
1,Acushnet,1,NaN,NaN,NaN,NaN
2,Agawam,301,246.0,81.70%,30.50%,28.90%
3,Amesbury,135,109.0,80.70%,23.90%,38.50%
4,Andover,430,390.0,90.70%,53.80%,34.90%

In [26]:
incomedata.head()

  Dollar Margin of Error        Town
0  87139            6492   Abington
1  71667           12877  Acushnet
2  55093           15995      Adams
3  77969            4094    Agawam
4  95963            8325  Amesbury

In [40]:
# why doesn't this work with inner, but it does with the other three options (which I don't want)?

merge = pd.merge(incomedata, educationdata, how='inner', on=['Town'])
merge.head()

Empty DataFrame
Columns: [Dollar, Margin of Error, Town, # High School Graduates, # Attending Coll./Univ., % Attending Coll./Univ., % Private Four-Year, % Public Four-Year]
Index: []